<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"38615fc75dc9ae4fb8b901026a0927aa36a18c79c5bad943d2164afa14bb9b68","plan_job_ref":"Job Cloudflare Infra #24 at https://github.com/SableClient/Sable/actions/runs/23094093199","plan_out_hash":"b04812c719486a8a2cdaa9133ef45da4b6c3b0ad616f09a863cb5a53ef0658f3","plan_hash":"05ad0bdfff603603d554eb8ce0ab85f1b4f3f6fd2fdfae30fd20c64e383a0d52","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "ae258ca9ce8c01a4a62f151968c1c9b2d4c37160d212aa97636ffb4ee5c19592" -> "afa5e8dcfbabf51ea3dca9e9fd6f876c5fbdbaa30f53b4c7f33a2e81f6dc7cda" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-12T04:55:08Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 72 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
!~          workers_message      = <<-EOT
              - Merge pull request #210 from SableClient/release
              - 
              - chore: prepare release 1.7.0
              + Fix workflows
            EOT
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
!~      author_email = "cloudflare@sl.sable.moe" -> (known after apply)
!~      created_on   = "2026-03-12T04:55:09Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #24](https://github.com/SableClient/Sable/actions/runs/23094093199)